; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation7 - direction
	Star9 - direction
	GroundStation8 - direction
	Star6 - direction
	Star1 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	GroundStation12 - direction
	GroundStation5 - direction
	Star14 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation13 - direction
	GroundStation11 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation11)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star19)
)
(:goal (and
	(have_image Planet15 image1)
	(have_image Phenomenon16 image1)
	(have_image Planet17 image1)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 planet17 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet17)
   goals met: 0 of 5
4. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 1 of 5
5. (turn_to satellite0 planet15 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet15)
   goals met: 1 of 5
6. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 5
7. (turn_to satellite0 phenomenon16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 5
8. (take_image satellite0 phenomenon16 instrument0 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 5
9. (turn_to satellite0 star18 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star18)
   goals met: 3 of 5
10. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 4 of 5
11. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 4 of 5
12. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 5 of 5
